{
  "slug": "adultflamedragon-tob1-2023",
  "name": "Adult Flame Dragon",
  "size": "Huge",
  "type": "Dragon",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Evil",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 275,
  "hit_dice": "22d12 + 132",
  "speed": {
    "walk": 80,
    "fly": 40
  },
  "strength": 19,
  "dexterity": 14,
  "constitution": 23,
  "intelligence": 17,
  "wisdom": 14,
  "charisma": 20,
  "skills": {
    "Deception": 10,
    "Perception": 12,
    "Persuasion": 10,
    "Stealth": 7
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "fire",
  "condition_immunities": "False",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
  "languages": "Common, Draconic, Ignan",
  "cr": 16,
  "challenge_rating": "16",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 15 (2d10 + 4) piercing damage plus 10 (3d6) fire damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Fire Breath (Recharge 5-6)",
      "desc": "The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 19 Dexterity saving throw, taking 56 (16d6) fire damage on a failed save, or half as much damage on a successful one. Each creature in that area must also succeed on a DC 18 Wisdom saving throw or go on a rampage for 1 minute. A rampaging creature must attack the nearest creature other than the dragon on its turn. If no other creature is near enough to move to and attack, the rampaging creature stalks off in a random direction, seeking a target for its rage. The rampaging creature can repeat the Wisdom saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "special_abilities": [
    {
      "name": "Fire Incarnate",
      "desc": "Creatures with resistance to fire damage don't have resistance to the fire damage dealt by the flame dragon. A creature with immunity to fire damage is still immune to the dragon's fire damage."
    },
    {
      "name": "Heated Body",
      "desc": "A creature that touches the flame dragon or hits it with a melee attack while within 5 feet of it takes 10 (3d6) fire damage."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    }
  ],
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a Tail attack."
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 17 Dexterity saving throw or take 11 (2d6 + 4) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
    }
  ]
}