{
  "slug": "anubian-tob1-2023",
  "name": "Anubian",
  "size": "Medium",
  "type": "Elemental",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Evil",
  "armor_class": 13,
  "armor_desc": "",
  "hit_points": 44,
  "hit_dice": "8d8 + 8",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 16,
  "constitution": 12,
  "intelligence": 10,
  "wisdom": 12,
  "charisma": 10,
  "skills": {
    "Stealth": 5
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "darkvision 60 ft., tremorsense 30 ft., passive Perception 11",
  "languages": "Primordial",
  "cr": 2,
  "challenge_rating": "2",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The anubian makes two Claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage."
    },
    {
      "name": "Haboob (1/Day)",
      "desc": "A 30-foot-tall cylinder of sand forms in the anubian's space and moves with it for 10 minutes, until the anubian ends the storm as a bonus action, or until its concentration ends (as if concentrating on a spell). The area within 5 feet of the anubian is heavily obscured. A creature that starts its turn in that area or enters the area for the first time on a turn must succeed on a DC 13 Strength saving throw or be restrained by the storm. While restrained, the creature takes 3 (1d6) slashing damage at the start of each of its turns, and moves with the anubian when the anubian moves. A creature, including the restrained creature, can use its action to free the restrained creature by succeeding on a DC 13 Strength check."
    }
  ],
  "special_abilities": [
    {
      "name": "Elemental Nature",
      "desc": "The anubian doesn't require air, food, drink, or sleep."
    },
    {
      "name": "Sand Camouflage",
      "desc": "The anubian has advantage on Dexterity (Stealth) checks made to hide in sandy terrain."
    },
    {
      "name": "Sand Form",
      "desc": "The anubian can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Vulnerability to Water",
      "desc": "For every 5 feet the anubian moves in water, or for every gallon of water splashed on it, it takes 2 (1d4) cold damage. An anubian completely immersed in water takes 10 (4d4) cold damage at the start of its turn."
    }
  ],
  "legendary_actions": []
}