{
  "slug": "black_pudding_bf",
  "name": "Black Pudding",
  "size": "large",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 7,
  "armor_desc": null,
  "hit_points": 122,
  "hit_dice": "",
  "speed": {
    "walk": 20,
    "climb": 20
  },
  "strength": 20,
  "dexterity": 4,
  "constitution": 16,
  "intelligence": 1,
  "wisdom": 6,
  "charisma": 1,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Ooze Resilience",
  "damage_immunities": "acid,lightning,slashing,grappled,Ooze Resilience",
  "condition_immunities": "",
  "senses": "keensense 60 ft. (can't sense beyond this radius)",
  "languages": "-",
  "cr": 4,
  "challenge_rating": "4",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The black pudding makes two Pseudopod attacks."
    },
    {
      "name": "Pseudopod",
      "desc": "_Melee Weapon Attack:_ +5 to hit, reach 5 ft., one target. _Hit:_ 6 (1d6+3) bludgeoning damage plus 9 (2d8) acid damage. In addition, nonmagical armor worn by the target is partly dissolved and takes a permanent and cumulative -1 penalty to the AC it offers. Armor reduced to an AC of 10 is destroyed."
    }
  ],
  "special_abilities": [
    {
      "name": "Amorphous",
      "desc": "The pudding can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Corrosive Form",
      "desc": "A creature that touches the pudding or hits it with a melee attack while within 5 feet of it takes 4 (1d8) acid damage. Any nonmagical weapon made of metal or wood that hits the pudding corrodes. After dealing damage, the weapon takes a permanent and cumulative -1 penalty to damage rolls. If its penalty drops to -5, the weapon is destroyed. Nonmagical ammunition made of metal or wood that hits the pudding is destroyed after dealing damage. The pudding can eat through a panel of nonmagical wood or metal in its space that is up to 2 inches thick in 1 round."
    },
    {
      "name": "Ooze Nature",
      "desc": "The pudding doesn't require sleep."
    },
    {
      "name": "Ooze Resilience",
      "desc": "The pudding is resistant to the restrained condition, and it is immune to exhaustion and to the blinded, charmed, deafened, frightened, and prone conditions."
    },
    {
      "name": "Spider Climb",
      "desc": "The pudding can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    }
  ],
  "legendary_actions": []
}