{
  "slug": "crystallinedevil-tob1-2023",
  "name": "Crystalline Devil",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": "null",
  "alignment": "Lawful Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 102,
  "hit_dice": "12d8 + 48",
  "speed": {
    "walk": 30
  },
  "strength": 18,
  "dexterity": 12,
  "constitution": 18,
  "intelligence": 14,
  "wisdom": 13,
  "charisma": 15,
  "skills": {
    "Deception": 8,
    "Insight": 4,
    "Stealth": 7
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "acid, cold; bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "damage_immunities": "fire, poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 120 ft., passive Perception 11",
  "languages": "Celestial, Common, Infernal, telepathy 120 ft.",
  "cr": 6,
  "challenge_rating": "6",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The devil makes three Claw attacks."
    },
    {
      "name": "Shard Claw (Fiend Form Only)",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage."
    },
    {
      "name": "Crystalline Spray (Recharge 5-6)",
      "desc": "The crystalline devil sprays a burst of crystal shards. Each creature within 15 feet of the devil must make a DC 15 Dexterity saving throw, taking 27 (6d8) piercing damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "special_abilities": [
    {
      "name": "Devil's Sight",
      "desc": "Magical darkness doesn't impede the crystalline devil's darkvision."
    },
    {
      "name": "False Appearance (Gemstone Form Only)",
      "desc": "While the devil remains motionless, it is indistinguishable from an ordinary gemstone."
    },
    {
      "name": "Glittering Temptation (Gemstone Form Only)",
      "desc": "The devil sheds dim light in a 5-foot radius. Each creature that starts its turn within 30 feet of the devil and that can see it must succeed on a DC 15 Wisdom saving throw or be charmed for 1 minute. While charmed, a creature is incapacitated and must move on its turn toward the devil by the safest route, trying to get within 5 feet of the devil to hold it. The charmed creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. On a success, a creature is also immune to this devil's Glittering Temptation for the next 24 hours. A creature charmed by the devil has disadvantage on the saving throw against Crystalline Spray."
    },
    {
      "name": "Magic Resistance",
      "desc": "The crystalline devil has advantage on saving throws against spells and other magical effects."
    }
  ],
  "legendary_actions": []
}