{
  "slug": "darkmantle_bf",
  "name": "Darkmantle",
  "size": "small",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 11,
  "armor_desc": null,
  "hit_points": 25,
  "hit_dice": "",
  "speed": {
    "walk": 10,
    "fly": 30
  },
  "strength": 16,
  "dexterity": 12,
  "constitution": 12,
  "intelligence": 2,
  "wisdom": 10,
  "charisma": 4,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Monstrosity Resilience",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "keensense 60 ft.",
  "languages": "-",
  "cr": 0.5,
  "challenge_rating": "1/2",
  "actions": [
    {
      "name": "Crush",
      "desc": "_Melee Weapon Attack:_ +5 to hit, reach 5 ft., one creature. _Hit:_ 6 (1d6+3) bludgeoning damage, and the darkmantle attaches to it. If the target is Medium or smaller and the darkmantle has advantage on the attack roll, the darkmantle attaches to the target's head, and the target is blinded and unable to breathe while the darkmantle is attached. While attached, the darkmantle can't make Crush attacks, and at the start of each of the darkmantle's turns, the target takes 6 (1d6+3) bludgeoning damage.<br>The attached darkmantle moves with the target whenever the target moves, requiring none of the darkmantle's movement. It can detach itself by spending 5 feet of its movement on its turn. A creature, including the target, can take its action to detach the darkmantle by succeeding on a DC 13 STR check."
    },
    {
      "name": "Topple",
      "desc": "While attached to a creature, the darkmantle swings its body to throw off the balance of the creature to which it is attached. The attached target must succeed on a DC 13 DEX save or be knocked prone. If the target fails the save and is already prone, it is restrained while the darkmantle is attached to it, as the darkmantle pins it to the ground."
    }
  ],
  "special_abilities": [
    {
      "name": "Echolocation",
      "desc": "The darkmantle can't use its keensense while deafened."
    },
    {
      "name": "False Appearance",
      "desc": "While the darkmantle remains motionless, it is indistinguishable from a cave formation, such as a stalactite or stalagmite."
    },
    {
      "name": "Jagged Hide",
      "desc": "A creature that hits the darkmantle with a melee attack while within 5 feet of it takes 2 (1d4) piercing damage."
    },
    {
      "name": "Monstrosity Resilience",
      "desc": "The darkmantle is resistant to exhaustion and to the frightened condition."
    }
  ],
  "legendary_actions": []
}