{
  "slug": "gildeddevil-tob1-2023",
  "name": "Gilded Devil",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": "null",
  "alignment": "Lawful Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 112,
  "hit_dice": "15d8 + 45",
  "speed": {
    "walk": 30
  },
  "strength": 20,
  "dexterity": 15,
  "constitution": 17,
  "intelligence": 15,
  "wisdom": 18,
  "charisma": 17,
  "skills": {
    "Deception": 9,
    "History": 5,
    "Insight": 7,
    "Persuasion": 9,
    "Sleight of Hand": 5
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "cold; bludgeoning, piercing, and slashing damage from nonmagical attacks not made with silvered weapons",
  "damage_immunities": "fire, poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Celestial, Common, Draconic, Infernal, telepathy 120 ft.",
  "cr": 7,
  "challenge_rating": "7",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The gilded devil makes two Golden Flail attacks or three Hurl Flame attacks."
    },
    {
      "name": "Golden Flail",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 10 (1d10 + 5) bludgeoning damage plus 14 (4d6) fire damage."
    },
    {
      "name": "Hurl Flame",
      "desc": "Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 14 (3d6 + 4) fire damage."
    },
    {
      "name": "Teleport (Recharge 4-6)",
      "desc": "The gilded devil magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
    },
    {
      "name": "Voracious Greed",
      "desc": "The gilded devil magically consumes up to 1 cubic foot of nonmagical jewelry or coins made of precious material within 5 feet of it. It regains 5 hp for every 200 gp of the consumed objects' value. If the jewelry or coins are being worn or carried by a creature, that creature must succeed on a DC 15 Dexterity saving throw to prevent the consumption."
    },
    {
      "name": "Spellcasting",
      "desc": "The gilded devil casts one of the following spells, requiring no material components and using Wisdom as the spellcasting ability (spell save DC 15):\nAt will: alter self, detect thoughts, suggestion\n3/day each: charm person, scrying"
    }
  ],
  "special_abilities": [
    {
      "name": "Devil's Sight",
      "desc": "Magical darkness doesn't impede the gilded devil's darkvision."
    },
    {
      "name": "Golden Flail",
      "desc": "The gilded devil's Golden Flail attacks are magical. When the devil hits with the Golden Flail, the flail deals an extra 4d6 fire damage (included in the attack). In addition, the devil can transform the flail into gold jewelry or back into a weapon as a bonus action."
    },
    {
      "name": "Liar's Largesse",
      "desc": "If a creature accepts a gift of jewelry from the gilded devil, the creature becomes cursed until cured by a remove curse spell or similar magic. While cursed, the creature has disadvantage on saving throws against the devil's spells and abilities."
    },
    {
      "name": "Magic Resistance",
      "desc": "The gilded devil has advantage on saving throws against spells and other magical effects."
    }
  ],
  "legendary_actions": []
}