{
  "slug": "kikimora-tob1-2023",
  "name": "Kikimora",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 78,
  "hit_dice": "12d8 + 24",
  "speed": {
    "walk": 30
  },
  "strength": 13,
  "dexterity": 18,
  "constitution": 15,
  "intelligence": 12,
  "wisdom": 16,
  "charisma": 21,
  "skills": {
    "Deception": 8,
    "Persuasion": 8,
    "Stealth": 7
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "False",
  "condition_immunities": "False",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "Common, Sylvan",
  "cr": 5,
  "challenge_rating": "5",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The kikimora makes three Claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage."
    },
    {
      "name": "Domestic Magic",
      "desc": "The kikimora can cast the mending, minor illusion, and prestidigitation cantrips at will, requiring no material components and using Charisma as the spellcasting ability."
    },
    {
      "name": "Invisibility",
      "desc": "The kikimora magically turns invisible until it attacks or casts a spell, or until its concentration ends (as if concentrating on a spell). Any equipment the kikimora wears or carries is invisible with it."
    },
    {
      "name": "House Pests (1/Day)",
      "desc": "The kikimora magically calls 1 swarm of bats, insects, or rats. The called creatures arrive in 1d4 rounds, acting as allies of the kikimora and obeying its spoken commands. The Beasts remain for 1 hour, until the kikimora dies, or until the kikimora dismisses them as a bonus action."
    }
  ],
  "special_abilities": [
    {
      "name": "Hidden Home",
      "desc": "The kikimora can spend 1 minute scribing a magical symbol on a wall, baseboard, cupboard, or other semi-permanent object within a structure. The symbol remains until the kikimora inscribes another symbol elsewhere. While within 5 feet of the surface where the symbol is inscribed, the kikimora can use an action to touch the symbol and be transported to an extradimensional space just large enough to hold the kikimora and up to 50 pounds of nonmagical objects. Only the kikimora can enter this space, along with any nonmagical objects it is wearing or carrying, up to the extradimensional space's limits. While inside the extradimensional space, the kikimora can see out as if through a 2-foot-by-2-foot window centered on the symbol and can exit the space as an action, appearing in an unoccupied space within 10 feet of the surface where the symbol is inscribed."
    },
    {
      "name": "Magic Resistance",
      "desc": "The kikimora has advantage on saving throws against spells and other magical effects."
    }
  ],
  "legendary_actions": []
}