{
  "slug": "mytholabe",
  "name": "Mytholabe",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "unaligned",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 152,
  "hit_dice": "16d10+64",
  "speed": {
    "fly": 30,
    "hover": true,
    "walk": 0
  },
  "strength": 20,
  "dexterity": 13,
  "constitution": 18,
  "intelligence": 6,
  "wisdom": 16,
  "charisma": 1,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, fire, radiant, thunder",
  "damage_immunities": "poison, psychic; bludgeoning, piercing, and slashing from magical attacks",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned, prone",
  "senses": "passive Perception 13",
  "languages": "understands all but can't speak",
  "cr": 9,
  "challenge_rating": "9",
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mytholabe makes three heroic jab attacks. When its Purifying Resonance is available, it can use the resonance in place of one heroic jab attack."
    },
    {
      "name": "Heroic Jab",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) piercing damage plus 7 (2d6) radiant damage.",
      "attack_bonus": 9,
      "damage_dice": "1d8+5"
    },
    {
      "name": "Purifying Resonance (Recharge 5-6)",
      "desc": "The mytholabe thrums with a harmonic resonance that brings order to those within 30 feet. Each creature in that area must succeed on a DC 16 Constitution saving throw or have all conditions and magical effects on it ended immediately and any concentration it's maintaining broken."
    }
  ],
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The mytholabe is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The mytholabe has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The mytholabe's weapon attacks are magical."
    },
    {
      "name": "Melodious Recharge",
      "desc": "Whenever the mytholabe is hit by a magical weapon attack, it recharges its Purifying Resonance ability."
    },
    {
      "name": "Spanner in the Works",
      "desc": "When the mytholabe suffers a critical hit from a nonmagical weapon, the attacker quadruples the dice rolled instead of doubling them."
    },
    {
      "name": "Sentient Transformation",
      "desc": "If the mytholabe is inhabited by a sentient weapon, its mental statistics and alignment change to match that of the weapon's."
    },
    {
      "name": "Unbearable Scraping",
      "desc": "When the mytholabe is hit with a nonmagical melee weapon attack, each creature within 15 feet of it must succeed on a DC 16 Constitution saving throw or be deafened for 1 minute."
    },
    {
      "name": "Innate Spellcasting (1/Day)",
      "desc": "The mytholabe can innately cast plane shift on itself only, requiring no material components. Its innate spellcasting ability is Wisdom."
    }
  ],
  "legendary_actions": null
}